In [1]:
import numpy as np
import pandas as pd

# 访问数据方法

In [2]:
data = {
    '姓名': ['李四', '张三', '赵六', '孙七'],
    '籍贯': ['山东', '天津', '北京', '山东'],
    '年龄': [41, 28, np.nan, 34],
    '成绩': [88.0, 79.0, 81.0, 80.0]
}

学号 = [102, 101, 103, 104]
df = pd.DataFrame(data, index=学号)
df

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0
104  孙七  山东  34.0  80.0

### 1. 数据访问的基础访问入口

In [3]:
df['姓名']

102    李四
101    张三
103    赵六
104    孙七
Name: 姓名, dtype: object

In [4]:
df.姓名

102    李四
101    张三
103    赵六
104    孙七
Name: 姓名, dtype: object

In [5]:
df[['姓名', '成绩']]

     姓名    成绩
102  李四  88.0
101  张三  79.0
103  赵六  81.0
104  孙七  80.0

In [6]:
df[['姓名']]

     姓名
102  李四
101  张三
103  赵六
104  孙七

In [7]:
df[0:2]

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0

In [8]:
df[-1:-3:-1]

     姓名  籍贯    年龄    成绩
104  孙七  山东  34.0  80.0
103  赵六  北京   NaN  81.0

In [9]:
df[0]

KeyError: 0

In [10]:
df[df.籍贯 == '山东'][['姓名', '成绩']]

     姓名    成绩
102  李四  88.0
104  孙七  80.0

In [11]:
df[['姓名', '成绩']][df.籍贯 == '山东']

     姓名    成绩
102  李四  88.0
104  孙七  80.0

<br>

### 2. 按索引名访问数据方法

In [12]:
df

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0
104  孙七  山东  34.0  80.0

In [13]:
df.loc[101]

姓名      张三
籍贯      天津
年龄    28.0
成绩    79.0
Name: 101, dtype: object

In [14]:
df.loc[:, '姓名']

102    李四
101    张三
103    赵六
104    孙七
Name: 姓名, dtype: object

In [15]:
df.loc[101, '姓名']

'张三'

In [16]:
df

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0
104  孙七  山东  34.0  80.0

In [17]:
df.loc[[103, 101]]

     姓名  籍贯    年龄    成绩
103  赵六  北京   NaN  81.0
101  张三  天津  28.0  79.0

In [18]:
df.loc[:, ['姓名', '成绩']]

     姓名    成绩
102  李四  88.0
101  张三  79.0
103  赵六  81.0
104  孙七  80.0

In [19]:
df.loc[[103, 101], ['姓名', '成绩']]

     姓名    成绩
103  赵六  81.0
101  张三  79.0

In [20]:
df.loc[[101], ['姓名']]

     姓名
101  张三

In [21]:
df

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0
104  孙七  山东  34.0  80.0

In [22]:
df.loc[102:103]

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0

In [23]:
df.loc[:, '姓名':'年龄']

     姓名  籍贯    年龄
102  李四  山东  41.0
101  张三  天津  28.0
103  赵六  北京   NaN
104  孙七  山东  34.0

In [24]:
df.loc[102:103, '姓名':'年龄']

     姓名  籍贯    年龄
102  李四  山东  41.0
101  张三  天津  28.0
103  赵六  北京   NaN

In [25]:
df.loc[102:102, '姓名':'姓名']

     姓名
102  李四

In [26]:
df.loc[102:104, ['姓名', '籍贯']]

     姓名  籍贯
102  李四  山东
101  张三  天津
103  赵六  北京
104  孙七  山东

In [27]:
df

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0
104  孙七  山东  34.0  80.0

In [28]:
df.loc[102:103, '姓名':'年龄']

     姓名  籍贯    年龄
102  李四  山东  41.0
101  张三  天津  28.0
103  赵六  北京   NaN

### 使用位置下标访问数据

In [29]:
df

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0
104  孙七  山东  34.0  80.0

In [30]:
df.iloc[0, 0]

'李四'

In [31]:
df.iloc[0]

姓名      李四
籍贯      山东
年龄    41.0
成绩    88.0
Name: 102, dtype: object

In [32]:
df.iloc[0:2]

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0

In [33]:
df.iloc[0:2, [0, 3]]

     姓名    成绩
102  李四  88.0
101  张三  79.0

In [34]:
df.iloc[:2].loc[:, ['姓名']]

     姓名
102  李四
101  张三

In [35]:
df[:2][['姓名']]

     姓名
102  李四
101  张三

### 使用布尔掩码查询数据

In [36]:
df.籍贯 == '山东'

102     True
101    False
103    False
104     True
Name: 籍贯, dtype: bool

In [37]:
df[df.籍贯 == '山东']

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
104  孙七  山东  34.0  80.0

In [38]:
df.loc[df.籍贯 == '山东']

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
104  孙七  山东  34.0  80.0

In [39]:
df[(df.籍贯 == '山东') & (df.年龄 < 40)]

     姓名  籍贯    年龄    成绩
104  孙七  山东  34.0  80.0

In [40]:
df[~(df.籍贯 == '山东') & ((df.年龄 < 30) | (df.年龄 > 40))]

     姓名  籍贯    年龄    成绩
101  张三  天津  28.0  79.0

In [41]:
df[df.籍贯.isin(['天津', '北京'])]

     姓名  籍贯    年龄    成绩
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0

In [42]:
df[df.年龄.between(30, 40)]

     姓名  籍贯    年龄    成绩
104  孙七  山东  34.0  80.0

In [43]:
df.loc[103].isna()

姓名    False
籍贯    False
年龄     True
成绩    False
Name: 103, dtype: bool

In [44]:
df.loc[:, df.loc[103].isna()]

       年龄
102  41.0
101  28.0
103   NaN
104  34.0

In [45]:
df.isna()

        姓名     籍贯     年龄     成绩
102  False  False  False  False
101  False  False  False  False
103  False  False   True  False
104  False  False  False  False

In [46]:
df.isna().any()

姓名    False
籍贯    False
年龄     True
成绩    False
dtype: bool

In [47]:
df.isna().any(axis=1)

102    False
101    False
103     True
104    False
dtype: bool

In [48]:
df[df.isna().any(axis=1)]

     姓名  籍贯  年龄    成绩
103  赵六  北京 NaN  81.0

In [49]:
df.loc[:, df.isna().any()]

       年龄
102  41.0
101  28.0
103   NaN
104  34.0

### 修改数据列、定义新列

In [50]:
df1 = df.copy()
df1

     姓名  籍贯    年龄    成绩
102  李四  山东  41.0  88.0
101  张三  天津  28.0  79.0
103  赵六  北京   NaN  81.0
104  孙七  山东  34.0  80.0

In [51]:
df1['平时成绩'] = [80.0, 81.0, 82.0, 83.0]
df1['总评成绩'] = 0.3 * df1.平时成绩 + 0.7 * df1.成绩
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  85.6
101  张三  天津  28.0  79.0  81.0  79.6
103  赵六  北京   NaN  81.0  82.0  81.3
104  孙七  山东  34.0  80.0  83.0  80.9

In [52]:
df1.总评成绩 = np.round(df1.总评成绩, 0)
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  86.0
101  张三  天津  28.0  79.0  81.0  80.0
103  赵六  北京   NaN  81.0  82.0  81.0
104  孙七  山东  34.0  80.0  83.0  81.0

In [53]:
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  86.0
101  张三  天津  28.0  79.0  81.0  80.0
103  赵六  北京   NaN  81.0  82.0  81.0
104  孙七  山东  34.0  80.0  83.0  81.0

In [54]:
df2 = df1.copy()
df2.成绩2 = [80.0, 81.0, 82.0, 83.0]
df2

/tmp/ipykernel_693344/1439099637.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df2.成绩2 = [80.0, 81.0, 82.0, 83.0]

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  86.0
101  张三  天津  28.0  79.0  81.0  80.0
103  赵六  北京   NaN  81.0  82.0  81.0
104  孙七  山东  34.0  80.0  83.0  81.0

In [55]:
df1.loc[df1.姓名 == '赵六', ['成绩', '平时成绩']]

       成绩  平时成绩
103  81.0  82.0

In [56]:
df1.loc[df1.姓名 == '赵六', ['成绩', '平时成绩']] = [75, 80]

df1['总评成绩'] = np.round(0.3 * df1.平时成绩 + 0.7 * df1.成绩, 0)
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  86.0
101  张三  天津  28.0  79.0  81.0  80.0
103  赵六  北京   NaN  75.0  80.0  76.0
104  孙七  山东  34.0  80.0  83.0  81.0

In [57]:
df1['平时成绩'] = [80.0, 81.0, 82.0, 83.0]
df1['总评成绩'] = 0.3 * df1.平时成绩 + 0.7 * df1.成绩
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  85.6
101  张三  天津  28.0  79.0  81.0  79.6
103  赵六  北京   NaN  75.0  82.0  77.1
104  孙七  山东  34.0  80.0  83.0  80.9

### 使用`.loc[ ]`修改部分数据

In [58]:
df1.loc[df1.姓名 == '赵六', ['成绩', '平时成绩']] = [75, 80]
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  85.6
101  张三  天津  28.0  79.0  81.0  79.6
103  赵六  北京   NaN  75.0  80.0  77.1
104  孙七  山东  34.0  80.0  83.0  80.9

In [59]:
df1['总评成绩'] = np.round(0.3 * df1.平时成绩 + 0.7 * df1.成绩, 0)
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  86.0
101  张三  天津  28.0  79.0  81.0  80.0
103  赵六  北京   NaN  75.0  80.0  76.0
104  孙七  山东  34.0  80.0  83.0  81.0

### 避免链式修改

In [60]:
df1.loc[df1.姓名 == '赵六']['年龄'] = 33

/tmp/ipykernel_693344/206985380.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1.loc[df1.姓名 == '赵六']['年龄'] = 33

In [61]:
df2 = df1.loc[df1.姓名 == '赵六']
df2['年龄'] = 33

/tmp/ipykernel_693344/1715230985.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2['年龄'] = 33

In [63]:
df1.loc[df1.姓名 == '赵六', '年龄'] = 33
df1

     姓名  籍贯    年龄    成绩  平时成绩  总评成绩
102  李四  山东  41.0  88.0  80.0  86.0
101  张三  天津  28.0  79.0  81.0  80.0
103  赵六  北京  33.0  75.0  80.0  76.0
104  孙七  山东  34.0  80.0  83.0  81.0